# -*- coding: utf-8 -*-
import scrapy,re,json,pprint
from NEW_GGZY.Exist import *
from urllib import parse
from NEW_GGZY.Breakpoint import *
TEMPPATH = TMEPTEST()



class GdMaomingSpider(scrapy.Spider):
    name = 'gd_maoming'
    allowed_domains = ['218.15.22.157']
    # start_urls = ['http://218.15.22.157/mmzbtb/jyxx/']
    base_urls =[{'catName': '茂名市_交易信息_产权交易_市直_交易公告_产权交易', 'url': 'http://218.15.22.157/mmzbtb/jyxx/033005/033005001/033005001001/033005001001001/'}, {'catName': '茂名市_交易信息_产权交易_市直_交易公告_公车拍卖', 'url': 'http://218.15.22.157/mmzbtb/jyxx/033005/033005001/033005001001/033005001001002/'}, {'catName': '茂名市_交易信息_土地矿产_市直_交易公告_土地', 'url': 'http://218.15.22.157/mmzbtb/jyxx/033004/033004001/033004001001/033004001001001/'}, {'catName': '茂名市_交易信息_土地矿产_市直_交易公告_矿产权', 'url': 'http://218.15.22.157/mmzbtb/jyxx/033004/033004001/033004001001/033004001001002/'}, {'catName': '茂名市_交易信息_土地矿产_县区_交易公告_土地', 'url': 'http://218.15.22.157/mmzbtb/jyxx/033004/033004002/033004002001/033004002001001/'}, {'catName': '茂名市_交易信息_土地矿产_县区_交易公告_矿产权', 'url': 'http://218.15.22.157/mmzbtb/jyxx/033004/033004002/033004002001/033004002001002/'}, {'catName': '茂名市_交易信息_土地矿产_市直_补充公告_土地', 'url': 'http://218.15.22.157/mmzbtb/jyxx/033004/033004001/033004001002/033004001002001/'}, {'catName': '茂名市_交易信息_土地矿产_市直_补充公告_矿产权', 'url': 'http://218.15.22.157/mmzbtb/jyxx/033004/033004001/033004001002/033004001002002/'}, {'catName': '茂名市_交易信息_土地矿产_县区_补充公告_土地', 'url': 'http://218.15.22.157/mmzbtb/jyxx/033004/033004002/033004002002/033004002002001/'}, {'catName': '茂名市_交易信息_土地矿产_县区_补充公告_矿产权', 'url': 'http://218.15.22.157/mmzbtb/jyxx/033004/033004002/033004002002/033004002002002/'}, {'catName': '茂名市_交易信息_土地矿产_市直_中标公示_土地', 'url': 'http://218.15.22.157/mmzbtb/jyxx/033004/033004001/033004001003/033004001003001/'}, {'catName': '茂名市_交易信息_土地矿产_市直_中标公示_矿产权', 'url': 'http://218.15.22.157/mmzbtb/jyxx/033004/033004001/033004001003/033004001003002/'}, {'catName': '茂名市_交易信息_土地矿产_县区_中标公示_土地', 'url': 'http://218.15.22.157/mmzbtb/jyxx/033004/033004002/033004002003/033004002003001/'}, {'catName': '茂名市_交易信息_土地矿产_县区_中标公示_矿产权', 'url': 'http://218.15.22.157/mmzbtb/jyxx/033004/033004002/033004002003/033004002003002/'}, {'catName': '茂名市_交易信息_土地矿产_市直_其他公示_土地', 'url': 'http://218.15.22.157/mmzbtb/jyxx/033004/033004001/033004001004/033004001004001/'}, {'catName': '茂名市_交易信息_土地矿产_市直_其他公示_矿产权', 'url': 'http://218.15.22.157/mmzbtb/jyxx/033004/033004001/033004001004/033004001004002/'}, {'catName': '茂名市_交易信息_土地矿产_县区_其他公示_土地', 'url': 'http://218.15.22.157/mmzbtb/jyxx/033004/033004002/033004002004/033004002004001/'}, {'catName': '茂名市_交易信息_政府采购_市直_采购公告_公开招标', 'url': 'http://218.15.22.157/mmzbtb/jyxx/033002/033002001/033002001001/033002001001001/'}, {'catName': '茂名市_交易信息_政府采购_市直_采购公告_邀请招标', 'url': 'http://218.15.22.157/mmzbtb/jyxx/033002/033002001/033002001001/033002001001002/'}, {'catName': '茂名市_交易信息_政府采购_市直_采购公告_竞争性谈判', 'url': 'http://218.15.22.157/mmzbtb/jyxx/033002/033002001/033002001001/033002001001003/'}, {'catName': '茂名市_交易信息_政府采购_市直_采购公告_询价', 'url': 'http://218.15.22.157/mmzbtb/jyxx/033002/033002001/033002001001/033002001001004/'}, {'catName': '茂名市_交易信息_政府采购_市直_采购公告_单一来源', 'url': 'http://218.15.22.157/mmzbtb/jyxx/033002/033002001/033002001001/033002001001005/'}, {'catName': '茂名市_交易信息_政府采购_市直_采购公告_竞争性磋商', 'url': 'http://218.15.22.157/mmzbtb/jyxx/033002/033002001/033002001001/033002001001006/'}, {'catName': '茂名市_交易信息_政府采购_县区_采购公告_公开招标', 'url': 'http://218.15.22.157/mmzbtb/jyxx/033002/033002002/033002002001/033002002001001/'}, {'catName': '茂名市_交易信息_政府采购_县区_采购公告_邀请招标', 'url': 'http://218.15.22.157/mmzbtb/jyxx/033002/033002002/033002002001/033002002001002/'}, {'catName': '茂名市_交易信息_政府采购_县区_采购公告_竞争性谈判', 'url': 'http://218.15.22.157/mmzbtb/jyxx/033002/033002002/033002002001/033002002001003/'}, {'catName': '茂名市_交易信息_政府采购_县区_采购公告_询价', 'url': 'http://218.15.22.157/mmzbtb/jyxx/033002/033002002/033002002001/033002002001004/'}, {'catName': '茂名市_交易信息_政府采购_县区_采购公告_单一来源', 'url': 'http://218.15.22.157/mmzbtb/jyxx/033002/033002002/033002002001/033002002001005/'}, {'catName': '茂名市_交易信息_政府采购_县区_采购公告_竞争性磋商', 'url': 'http://218.15.22.157/mmzbtb/jyxx/033002/033002002/033002002001/033002002001006/'}, {'catName': '茂名市_交易信息_政府采购_市直_变更公告_公开招标', 'url': 'http://218.15.22.157/mmzbtb/jyxx/033002/033002001/033002001002/033002001002001/'}, {'catName': '茂名市_交易信息_政府采购_市直_变更公告_邀请招标', 'url': 'http://218.15.22.157/mmzbtb/jyxx/033002/033002001/033002001002/033002001002002/'}, {'catName': '茂名市_交易信息_政府采购_市直_变更公告_竞争性谈判', 'url': 'http://218.15.22.157/mmzbtb/jyxx/033002/033002001/033002001002/033002001002003/'}, {'catName': '茂名市_交易信息_政府采购_市直_变更公告_询价', 'url': 'http://218.15.22.157/mmzbtb/jyxx/033002/033002001/033002001002/033002001002004/'}, {'catName': '茂名市_交易信息_政府采购_市直_变更公告_单一来源', 'url': 'http://218.15.22.157/mmzbtb/jyxx/033002/033002001/033002001002/033002001002005/'}, {'catName': '茂名市_交易信息_政府采购_市直_变更公告_竞争性磋商', 'url': 'http://218.15.22.157/mmzbtb/jyxx/033002/033002001/033002001002/033002001002006/'}, {'catName': '茂名市_交易信息_政府采购_县区_变更公示_公开招标', 'url': 'http://218.15.22.157/mmzbtb/jyxx/033002/033002002/033002002002/033002002002001/'}, {'catName': '茂名市_交易信息_政府采购_县区_变更公示_邀请招标', 'url': 'http://218.15.22.157/mmzbtb/jyxx/033002/033002002/033002002002/033002002002002/'}, {'catName': '茂名市_交易信息_政府采购_县区_变更公示_竞争性谈判', 'url': 'http://218.15.22.157/mmzbtb/jyxx/033002/033002002/033002002002/033002002002003/'}, {'catName': '茂名市_交易信息_政府采购_县区_变更公示_询价', 'url': 'http://218.15.22.157/mmzbtb/jyxx/033002/033002002/033002002002/033002002002004/'}, {'catName': '茂名市_交易信息_政府采购_县区_变更公示_单一来源', 'url': 'http://218.15.22.157/mmzbtb/jyxx/033002/033002002/033002002002/033002002002005/'}, {'catName': '茂名市_交易信息_政府采购_县区_变更公示_竞争性磋商', 'url': 'http://218.15.22.157/mmzbtb/jyxx/033002/033002002/033002002002/033002002002006/'}, {'catName': '茂名市_交易信息_政府采购_市直_中标公示_公开招标', 'url': 'http://218.15.22.157/mmzbtb/jyxx/033002/033002001/033002001003/033002001003001/'}, {'catName': '茂名市_交易信息_政府采购_市直_中标公示_邀请招标', 'url': 'http://218.15.22.157/mmzbtb/jyxx/033002/033002001/033002001003/033002001003002/'}, {'catName': '茂名市_交易信息_政府采购_市直_中标公示_竞争性谈判', 'url': 'http://218.15.22.157/mmzbtb/jyxx/033002/033002001/033002001003/033002001003003/'}, {'catName': '茂名市_交易信息_政府采购_市直_中标公示_询价', 'url': 'http://218.15.22.157/mmzbtb/jyxx/033002/033002001/033002001003/033002001003004/'}, {'catName': '茂名市_交易信息_政府采购_市直_中标公示_单一来源', 'url': 'http://218.15.22.157/mmzbtb/jyxx/033002/033002001/033002001003/033002001003005/'}, {'catName': '茂名市_交易信息_政府采购_市直_中标公示_竞争性磋商', 'url': 'http://218.15.22.157/mmzbtb/jyxx/033002/033002001/033002001003/033002001003006/'}, {'catName': '茂名市_交易信息_政府采购_县区_中标公示_公开招标', 'url': 'http://218.15.22.157/mmzbtb/jyxx/033002/033002002/033002002003/033002002003001/'}, {'catName': '茂名市_交易信息_政府采购_县区_中标公示_邀请招标', 'url': 'http://218.15.22.157/mmzbtb/jyxx/033002/033002002/033002002003/033002002003002/'}, {'catName': '茂名市_交易信息_政府采购_县区_中标公示_竞争性谈判', 'url': 'http://218.15.22.157/mmzbtb/jyxx/033002/033002002/033002002003/033002002003003/'}, {'catName': '茂名市_交易信息_政府采购_县区_中标公示_询价', 'url': 'http://218.15.22.157/mmzbtb/jyxx/033002/033002002/033002002003/033002002003004/'}, {'catName': '茂名市_交易信息_政府采购_县区_中标公示_单一来源', 'url': 'http://218.15.22.157/mmzbtb/jyxx/033002/033002002/033002002003/033002002003005/'}, {'catName': '茂名市_交易信息_政府采购_县区_中标公示_竞争性磋商', 'url': 'http://218.15.22.157/mmzbtb/jyxx/033002/033002002/033002002003/033002002003006/'}, {'catName': '茂名市_交易信息_政府采购_市直_招标失败公告_公开招标', 'url': 'http://218.15.22.157/mmzbtb/jyxx/033002/033002001/033002001004/033002001004001/'}, {'catName': '茂名市_交易信息_政府采购_市直_招标失败公告_邀请招标', 'url': 'http://218.15.22.157/mmzbtb/jyxx/033002/033002001/033002001004/033002001004002/'}, {'catName': '茂名市_交易信息_政府采购_市直_招标失败公告_竞争性谈判', 'url': 'http://218.15.22.157/mmzbtb/jyxx/033002/033002001/033002001004/033002001004003/'}, {'catName': '茂名市_交易信息_政府采购_市直_招标失败公告_询价', 'url': 'http://218.15.22.157/mmzbtb/jyxx/033002/033002001/033002001004/033002001004004/'}, {'catName': '茂名市_交易信息_政府采购_市直_招标失败公告_单一来源', 'url': 'http://218.15.22.157/mmzbtb/jyxx/033002/033002001/033002001004/033002001004005/'}, {'catName': '茂名市_交易信息_政府采购_市直_招标失败公告_竞争性磋商', 'url': 'http://218.15.22.157/mmzbtb/jyxx/033002/033002001/033002001004/033002001004006/'}, {'catName': '茂名市_交易信息_政府采购_县区_招标失败公告_公开招标', 'url': 'http://218.15.22.157/mmzbtb/jyxx/033002/033002002/033002002004/033002002004001/'}, {'catName': '茂名市_交易信息_政府采购_县区_招标失败公告_邀请招标', 'url': 'http://218.15.22.157/mmzbtb/jyxx/033002/033002002/033002002004/033002002004002/'}, {'catName': '茂名市_交易信息_政府采购_县区_招标失败公告_竞争性谈判', 'url': 'http://218.15.22.157/mmzbtb/jyxx/033002/033002002/033002002004/033002002004003/'}, {'catName': '茂名市_交易信息_政府采购_县区_招标失败公告_询价', 'url': 'http://218.15.22.157/mmzbtb/jyxx/033002/033002002/033002002004/033002002004004/'}, {'catName': '茂名市_交易信息_政府采购_县区_招标失败公告_单一来源', 'url': 'http://218.15.22.157/mmzbtb/jyxx/033002/033002002/033002002004/033002002004005/'}, {'catName': '茂名市_交易信息_建设工程_市直_招标公告_施工', 'url': 'http://218.15.22.157/mmzbtb/jyxx/033001/033001001/033001001001/033001001001001/'}, {'catName': '茂名市_交易信息_建设工程_市直_招标公告_勘察设计', 'url': 'http://218.15.22.157/mmzbtb/jyxx/033001/033001001/033001001001/033001001001002/'}, {'catName': '茂名市_交易信息_建设工程_市直_招标公告_监理', 'url': 'http://218.15.22.157/mmzbtb/jyxx/033001/033001001/033001001001/033001001001003/'}, {'catName': '茂名市_交易信息_建设工程_市直_招标公告_其他', 'url': 'http://218.15.22.157/mmzbtb/jyxx/033001/033001001/033001001001/033001001001004/'}, {'catName': '茂名市_交易信息_建设工程_县区_招标公告_施工', 'url': 'http://218.15.22.157/mmzbtb/jyxx/033001/033001002/033001002001/033001002001001/'}, {'catName': '茂名市_交易信息_建设工程_县区_招标公告_勘察设计', 'url': 'http://218.15.22.157/mmzbtb/jyxx/033001/033001002/033001002001/033001002001002/'}, {'catName': '茂名市_交易信息_建设工程_县区_招标公告_监理', 'url': 'http://218.15.22.157/mmzbtb/jyxx/033001/033001002/033001002001/033001002001003/'}, {'catName': '茂名市_交易信息_建设工程_县区_招标公告_其他', 'url': 'http://218.15.22.157/mmzbtb/jyxx/033001/033001002/033001002001/033001002001004/'}, {'catName': '茂名市_交易信息_建设工程_市直_变更公告_施工', 'url': 'http://218.15.22.157/mmzbtb/jyxx/033001/033001001/033001001002/033001001002001/'}, {'catName': '茂名市_交易信息_建设工程_市直_变更公告_勘察设计', 'url': 'http://218.15.22.157/mmzbtb/jyxx/033001/033001001/033001001002/033001001002002/'}, {'catName': '茂名市_交易信息_建设工程_市直_变更公告_监理', 'url': 'http://218.15.22.157/mmzbtb/jyxx/033001/033001001/033001001002/033001001002003/'}, {'catName': '茂名市_交易信息_建设工程_市直_变更公告_其他', 'url': 'http://218.15.22.157/mmzbtb/jyxx/033001/033001001/033001001002/033001001002004/'}, {'catName': '茂名市_交易信息_建设工程_县区_变更公告_施工', 'url': 'http://218.15.22.157/mmzbtb/jyxx/033001/033001002/033001002002/033001002002001/'}, {'catName': '茂名市_交易信息_建设工程_县区_变更公告_勘察设计', 'url': 'http://218.15.22.157/mmzbtb/jyxx/033001/033001002/033001002002/033001002002002/'}, {'catName': '茂名市_交易信息_建设工程_县区_变更公告_监理', 'url': 'http://218.15.22.157/mmzbtb/jyxx/033001/033001002/033001002002/033001002002003/'}, {'catName': '茂名市_交易信息_建设工程_县区_变更公告_其他', 'url': 'http://218.15.22.157/mmzbtb/jyxx/033001/033001002/033001002002/033001002002004/'}, {'catName': '茂名市_交易信息_建设工程_市直_中标公示_施工', 'url': 'http://218.15.22.157/mmzbtb/jyxx/033001/033001001/033001001003/033001001003001/'}, {'catName': '茂名市_交易信息_建设工程_市直_中标公示_勘察设计', 'url': 'http://218.15.22.157/mmzbtb/jyxx/033001/033001001/033001001003/033001001003002/'}, {'catName': '茂名市_交易信息_建设工程_市直_中标公示_监理', 'url': 'http://218.15.22.157/mmzbtb/jyxx/033001/033001001/033001001003/033001001003003/'}, {'catName': '茂名市_交易信息_建设工程_市直_中标公示_其他', 'url': 'http://218.15.22.157/mmzbtb/jyxx/033001/033001001/033001001003/033001001003004/'}, {'catName': '茂名市_交易信息_建设工程_县区_中标公示_施工', 'url': 'http://218.15.22.157/mmzbtb/jyxx/033001/033001002/033001002003/033001002003001/'}, {'catName': '茂名市_交易信息_建设工程_县区_中标公示_勘察设计', 'url': 'http://218.15.22.157/mmzbtb/jyxx/033001/033001002/033001002003/033001002003002/'}, {'catName': '茂名市_交易信息_建设工程_县区_中标公示_监理', 'url': 'http://218.15.22.157/mmzbtb/jyxx/033001/033001002/033001002003/033001002003003/'}, {'catName': '茂名市_交易信息_建设工程_县区_中标公示_其他', 'url': 'http://218.15.22.157/mmzbtb/jyxx/033001/033001002/033001002003/033001002003004/'}, {'catName': '茂名市_交易信息_建设工程_市直_评审名单公示_施工', 'url': 'http://218.15.22.157/mmzbtb/jyxx/033001/033001001/033001001005/033001001005001/'}, {'catName': '茂名市_交易信息_建设工程_市直_评审名单公示_勘察设计', 'url': 'http://218.15.22.157/mmzbtb/jyxx/033001/033001001/033001001005/033001001005002/'}, {'catName': '茂名市_交易信息_建设工程_市直_评审名单公示_监理', 'url': 'http://218.15.22.157/mmzbtb/jyxx/033001/033001001/033001001005/033001001005003/'}, {'catName': '茂名市_交易信息_建设工程_市直_评审名单公示_其他', 'url': 'http://218.15.22.157/mmzbtb/jyxx/033001/033001001/033001001005/033001001005004/'}, {'catName': '茂名市_交易信息_建设工程_县区_评审名单公示_施工', 'url': 'http://218.15.22.157/mmzbtb/jyxx/033001/033001002/033001002005/033001002005001/'}, {'catName': '茂名市_交易信息_建设工程_县区_评审名单公示_勘察设计', 'url': 'http://218.15.22.157/mmzbtb/jyxx/033001/033001002/033001002005/033001002005002/'}, {'catName': '茂名市_交易信息_建设工程_县区_评审名单公示_监理', 'url': 'http://218.15.22.157/mmzbtb/jyxx/033001/033001002/033001002005/033001002005003/'}, {'catName': '茂名市_交易信息_建设工程_县区_评审名单公示_其他', 'url': 'http://218.15.22.157/mmzbtb/jyxx/033001/033001002/033001002005/033001002005004/'}, {'catName': '茂名市_交易信息_建设工程_市直_招标失败公告_施工', 'url': 'http://218.15.22.157/mmzbtb/jyxx/033001/033001001/033001001004/033001001004001/'}, {'catName': '茂名市_交易信息_建设工程_市直_招标失败公告_勘察设计', 'url': 'http://218.15.22.157/mmzbtb/jyxx/033001/033001001/033001001004/033001001004002/'}, {'catName': '茂名市_交易信息_建设工程_市直_招标失败公告_监理', 'url': 'http://218.15.22.157/mmzbtb/jyxx/033001/033001001/033001001004/033001001004003/'}, {'catName': '茂名市_交易信息_建设工程_市直_招标失败公告_其他', 'url': 'http://218.15.22.157/mmzbtb/jyxx/033001/033001001/033001001004/033001001004004/'}, {'catName': '茂名市_交易信息_建设工程_县区_招标失败公告_施工', 'url': 'http://218.15.22.157/mmzbtb/jyxx/033001/033001002/033001002004/033001002004001/'}, {'catName': '茂名市_交易信息_建设工程_县区_招标失败公告_勘察设计', 'url': 'http://218.15.22.157/mmzbtb/jyxx/033001/033001002/033001002004/033001002004002/'}, {'catName': '茂名市_交易信息_建设工程_县区_招标失败公告_监理', 'url': 'http://218.15.22.157/mmzbtb/jyxx/033001/033001002/033001002004/033001002004003/'}, {'catName': '茂名市_交易信息_建设工程_县区_招标失败公告_其他', 'url': 'http://218.15.22.157/mmzbtb/jyxx/033001/033001002/033001002004/033001002004004/'}, {'catName': '茂名市_交易信息_政府采购_县区_招标失败公告_竞争性磋商', 'url': 'http://218.15.22.157/mmzbtb/jyxx/033002/033002002/033002002004/033002002004006/'}, {'catName': '茂名市_交易信息_土地矿产_县区_其他公示_矿产权', 'url': 'http://218.15.22.157/mmzbtb/jyxx/033004/033004002/033004002004/033004002004002/'}, {'catName': '茂名市_交易信息_产权交易_县区_交易公告_产权交易', 'url': 'http://218.15.22.157/mmzbtb/jyxx/033005/033005002/033005002001/033005002001001/'}, {'catName': '茂名市_交易信息_产权交易_县区_交易公告_公车拍卖', 'url': 'http://218.15.22.157/mmzbtb/jyxx/033005/033005002/033005002001/033005002001002/'}, {'catName': '茂名市_交易信息_产权交易_市直_补充公告_产权交易', 'url': 'http://218.15.22.157/mmzbtb/jyxx/033005/033005001/033005001002/033005001002001/'}, {'catName': '茂名市_交易信息_产权交易_市直_补充公告_公车拍卖', 'url': 'http://218.15.22.157/mmzbtb/jyxx/033005/033005001/033005001002/033005001002002/'}, {'catName': '茂名市_交易信息_产权交易_县区_补充公告_产权交易', 'url': 'http://218.15.22.157/mmzbtb/jyxx/033005/033005002/033005002002/033005002002001/'}, {'catName': '茂名市_交易信息_产权交易_县区_补充公告_公车拍卖', 'url': 'http://218.15.22.157/mmzbtb/jyxx/033005/033005002/033005002002/033005002002002/'}, {'catName': '茂名市_交易信息_产权交易_市直_结果公示_产权交易', 'url': 'http://218.15.22.157/mmzbtb/jyxx/033005/033005001/033005001003/033005001003001/'}, {'catName': '茂名市_交易信息_产权交易_市直_结果公示_公车拍卖', 'url': 'http://218.15.22.157/mmzbtb/jyxx/033005/033005001/033005001003/033005001003002/'}, {'catName': '茂名市_交易信息_产权交易_县区_结果公示_产权交易', 'url': 'http://218.15.22.157/mmzbtb/jyxx/033005/033005002/033005002003/033005002003001/'}, {'catName': '茂名市_交易信息_产权交易_县区_结果公示_公车拍卖', 'url': 'http://218.15.22.157/mmzbtb/jyxx/033005/033005002/033005002003/033005002003002/'}, {'catName': '茂名市_交易信息_产权交易_市直_其他公示_产权交易', 'url': 'http://218.15.22.157/mmzbtb/jyxx/033005/033005001/033005001004/033005001004001/'}, {'catName': '茂名市_交易信息_产权交易_市直_其他公示_公车拍卖', 'url': 'http://218.15.22.157/mmzbtb/jyxx/033005/033005001/033005001004/033005001004002/'}, {'catName': '茂名市_交易信息_产权交易_县区_其他公示_产权交易', 'url': 'http://218.15.22.157/mmzbtb/jyxx/033005/033005002/033005002004/033005002004001/'}, {'catName': '茂名市_交易信息_产权交易_县区_其他公示_公车拍卖', 'url': 'http://218.15.22.157/mmzbtb/jyxx/033005/033005002/033005002004/033005002004002/'}]
    # base_urls = [{'catName': '茂名市_交易信息_政府采购_市直_变更公告_公开招标', 'url': 'http://218.15.22.157/mmzbtb/jyxx/033002/033002001/033002001002/033002001002001/'}]
    def start_requests(self):
        meta = {}
        getTXTdict = getTXT(self.name,self.base_urls,True)
        meta['Num'] = int(getTXTdict['Num'])
        for i in getTXTdict['urlDict']:
            meta['Breakpoint'] = i
            meta['catName'] = i['catName']
            meta['url'] = i['url'] + '?Paging={}'
            yield scrapy.Request(url=meta['url'].format(str(meta['Num'])), callback=self.parse,meta=meta)

    def parse(self, response):
        meta = response.meta
        link = response.xpath("//tr[@height = '22']/td[@align = 'left']/a/@href").extract()
        titleT = response.xpath("//tr[@height = '22']/td[@align = 'left']/a/@title").extract()
        timeT = response.xpath("//tr[@height = '22']/td[@width = '100']//text()").extract()
        titleT = remarkList(titleT)
        timeT = remarkList(timeT)

        if len(link) != len(titleT) or len(titleT) != len(timeT):

            meta['error'] = '列表页，文章、链接、时间。规则数量不同'
            meta['errorUrl'] = response.url
            errorLOG(meta)
            return None

        GotArtcl = 0
        notGotArtcl = 0
        if len(link) > 0:

            for i in range(len(link) + 1):
                urlListTemp = []
                # print('进入List循环体了')
                if notGotArtcl == 0 and GotArtcl == len(link):
                    # print('notGotArtcl == 0 and GotArtcl == len(link)-------------------------------没有新文章退出')
                    return None
                elif notGotArtcl != 0 and notGotArtcl + GotArtcl == len(link):
                    # print('notGotArtcl !=0 and notGotArtcl + GotArtcl == len(link)--------------------翻页')
                    meta['Num'] += 1
                    url = meta['url'].format(str(meta['Num']))
                    yield scrapy.Request(url=url, callback=self.parse, meta=meta)
                else:
                    # print('urlTemp = parse.urljoin(response.url, link[i])--------------------最终进入文章')
                    urlTemp = parse.urljoin(response.url, link[i])
                    urlListTemp.append(urlTemp + TEMPPATH)
                    urllist = urlIsExist(urlListTemp)
                    if len(urllist) < 1:
                        GotArtcl += 1
                        continue
                    else:
                        notGotArtcl += 1
                        for url in urllist:
                            try:
                                titleFont = re.findall(r"<font.*</font>", titleT[i])[0]
                                meta['articleTitle'] = titleT[i].replace(titleFont,'')
                            except:
                                meta['articleTitle'] = titleT[i]
                            meta['articleTime'] = timeT[i]
                            if not meta['articleTitle']:
                                meta['articleTitle'] = '本文暂无标题'
                            if not meta['articleTime']:
                                meta['articleTime'] = '2000-01-01 00:00:00'
                            meta['ListPageNow'] = '本页第{}条，共{}条'.format(notGotArtcl + GotArtcl, len(link))
                            yield scrapy.Request(url=url.replace(TEMPPATH,''), callback=self.parseA, meta=meta)
        else:

            meta['error'] = '该页面没有获取到文章链接'
            meta['errorUrl'] = response.url
            errorLOG(meta)
            return None

    def parseA(self, response):
        # print('进入文章了')
        meta = response.meta
        dict1 = {}
        html = response.xpath("//td[@id='spnShow'] | //table[@id='tblInfo']//tr[3]").extract()

        if html:
            dict1['url'] = response.url
            dict1['site'] = self.allowed_domains[0]
            dict1['title'] = meta['articleTitle']
            dict1['issueTime'] = timeReMark(meta['articleTime'])
            dict1['content'] = html[0]
            dict1['subclass'] = meta['catName']
            requestsAPI = save_api(dict1)

            tempDict = meta['Breakpoint']
            tempDict['Num'] = meta['Num']
            writeTXT(self.name, json.dumps(tempDict, ensure_ascii='utf-8'))

            print(dict1['title'])
            print(dict1['url'])
            print(dict1['issueTime'])
            print(dict1['subclass'])
            print(len(dict1['content']))
            print(requestsAPI.text)

            print(
                '-------------------------------------------------------------------------------------------------------------------------')
        else:
            meta['error'] = '最终页未能获取到文章内容'
            meta['errorUrl'] = response.url
            errorLOG(meta)
            return None